from random import *

answer=["Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да","Можешь быть уверен в этом", "Мне кажется - да", "Вероятнее всего", "Хорошие перспективы", "Знаки говорят - да", "Да", "Пока неясно, попробуй снова", "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать", "Сконцентрируйся и спроси опять", "Даже не думай", "Мой ответ - нет", "По моим данным - нет", "Перспективы не очень хорошие", "Весьма сомнительно"]
print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.','\nКак тебя зовут?')
name=input('Введите свое имя: ')
print('Привет,', name)
while True:
    print('Задай мне любой вопрос, на который может быть ответ "да"или "нет".')
    answ=input()
    print(choice(answer))
    a=input('Хочешь задать еще один вопрос?(да/нет): ')
    if a=='нет':
        break
